<?php

use Illuminate\Foundation\Testing\RefreshDatabase;

/*

|--------------------------------------------------------------------------
| Test Case
|--------------------------------------------------------------------------

|
| Здесь мы говорим Pest, что Feature-тесты должны использовать базовый 
| класс TestCase от Laravel, чтобы у нас работал метод $this->get().

|
*/

uses(Tests\TestCase::class, RefreshDatabase::class)->in('Feature');


/*
|--------------------------------------------------------------------------
| Expectations

|--------------------------------------------------------------------------
|
| Здесь можно добавить свои "ожидания" (например, expect($user)->toBeAdmin()).
|
*/
